In [1]:
people = {
    'first':['James','Daniel','Amy','Trevon'],
    'last':['Charles','Radcliffe','Schumer','Martin'],
    'gender':['male','male','female','male']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

    first       last  gender
0   James    Charles    male
1  Daniel  Radcliffe    male
2     Amy    Schumer  female
3  Trevon     Martin    male

In [5]:
df.set_index('gender')

         first       last
gender
male     James    Charles
male    Daniel  Radcliffe
female     Amy    Schumer
male    Trevon     Martin

In [6]:
df

    first       last  gender
0   James    Charles    male
1  Daniel  Radcliffe    male
2     Amy    Schumer  female
3  Trevon     Martin    male

In [7]:
df.reset_index(inplace=True)

In [8]:
df.columns

Index(['index', 'first', 'last', 'gender'], dtype='object')

In [9]:
df.gender

0      male
1      male
2    female
3      male
Name: gender, dtype: object

In [10]:
df[['gender', 'last', 'first']]

   gender       last   first
0    male    Charles   James
1    male  Radcliffe  Daniel
2  female    Schumer     Amy
3    male     Martin  Trevon

In [11]:
df

   index   first       last  gender
0      0   James    Charles    male
1      1  Daniel  Radcliffe    male
2      2     Amy    Schumer  female
3      3  Trevon     Martin    male

In [12]:
df['first'] + ' ' + df['last']

0       James Charles
1    Daniel Radcliffe
2         Amy Schumer
3       Trevon Martin
dtype: object

In [13]:
df['full_name'] = df['first'] + ' ' + df['last']

In [14]:
df

   index   first       last  gender         full_name
0      0   James    Charles    male     James Charles
1      1  Daniel  Radcliffe    male  Daniel Radcliffe
2      2     Amy    Schumer  female       Amy Schumer
3      3  Trevon     Martin    male     Trevon Martin

In [15]:
df.drop(columns='index', inplace=True)

In [16]:
df

    first       last  gender         full_name
0   James    Charles    male     James Charles
1  Daniel  Radcliffe    male  Daniel Radcliffe
2     Amy    Schumer  female       Amy Schumer
3  Trevon     Martin    male     Trevon Martin

In [17]:
df = df.applymap(str.lower)

In [18]:
df

    first       last  gender         full_name
0   james    charles    male     james charles
1  daniel  radcliffe    male  daniel radcliffe
2     amy    schumer  female       amy schumer
3  trevon     martin    male     trevon martin

In [20]:
df['full_name'].str.split(' ')

0       [james, charles]
1    [daniel, radcliffe]
2         [amy, schumer]
3       [trevon, martin]
Name: full_name, dtype: object

In [21]:
df

    first       last  gender         full_name
0   james    charles    male     james charles
1  daniel  radcliffe    male  daniel radcliffe
2     amy    schumer  female       amy schumer
3  trevon     martin    male     trevon martin

In [30]:
df.drop(columns=['first', 'last'])

   gender         full_name
0    male     james charles
1    male  daniel radcliffe
2  female       amy schumer
3    male     trevon martin

In [31]:
df['full_name'].str.split(' ', expand=True)

        0          1
0   james    charles
1  daniel  radcliffe
2     amy    schumer
3  trevon     martin

In [35]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [36]:
df

    first       last  gender         full_name
0   james    charles    male     james charles
1  daniel  radcliffe    male  daniel radcliffe
2     amy    schumer  female       amy schumer
3  trevon     martin    male     trevon martin

In [37]:
df.drop(columns='full_name')

    first       last  gender
0   james    charles    male
1  daniel  radcliffe    male
2     amy    schumer  female
3  trevon     martin    male

In [38]:
df.drop(index=3)

    first       last  gender         full_name
0   james    charles    male     james charles
1  daniel  radcliffe    male  daniel radcliffe
2     amy    schumer  female       amy schumer

In [47]:
df = df.append({
    'first': 'James',
    'last': 'Peasey',
    'gender': 'male',
    'full_name': 'James Peasey'
}, ignore_index=True)

In [48]:
df = df.applymap(str.lower)

In [49]:
df

    first       last  gender         full_name
0   james    charles    male     james charles
1  daniel  radcliffe    male  daniel radcliffe
2     amy    schumer  female       amy schumer
3  trevon     martin    male     trevon martin
4   james     peasey    male      james peasey

In [50]:
filt = df['first'] == 'james'

In [52]:
df.drop(index=df[filt].index)

    first       last  gender         full_name
1  daniel  radcliffe    male  daniel radcliffe
2     amy    schumer  female       amy schumer
3  trevon     martin    male     trevon martin